---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.AreaBasedLoadType
source: html/e8bfadad-cbdc-b01f-544a-76fec7f908af.htm
---
# AreaBasedLoadType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.